from datetime import timedelta, time
from typing import Union

import pytest

from handlers import kto


@pytest.mark.parametrize(
    "text,expected",
    [
        ("гулять сейчас", ("гулять", "сейчас")),
        ("пойдёт гулять сейчас", ("пойдёт гулять", "сейчас")),
        ("сейчас пойдёт гулять", ("пойдёт гулять", "сейчас")),
        ("пойдёт сейчас гулять", ("пойдёт гулять", "сейчас")),
        ("борщ через 15 минут", ("борщ", timedelta(minutes=15))),
        ("пидор", ("пидор", None)),
        ("смотреть кино", ("смотреть кино", None)),
        ("настолки через два часа у Евгена", ("настолки у Евгена", timedelta(hours=2))),
        ("настолки в 18:30 у Евгена", ("настолки у Евгена", time(18, 30))),
        ("борщ 19", ("борщ", time(19))),
        ("борщ 19?", ("борщ", time(19))),
        ("борщ в 19", ("борщ", time(19))),
        ("борщ в 19 часов", ("борщ", time(19))),
        ("12", ("", 12)),
        ("16:45", ("", time(16, 45))),
        ("через 5 минут", ("", timedelta(minutes=5))),
        ("играть 7", ("играть", 7)),
        ("спать никогда", ("спать", "никогда")),
        ("дрочить 19:45", ("дрочить", time(19, 45))),
        ("дрочить в 19:45", ("дрочить", time(19, 45))),
        ("жрать ёпта", ("жрать", "ёпта")),
        ("жрать ёпта?", ("жрать", "ёпта")),
        ("я", ("я", None)),
        ("", ("", None)),
    ],
)
def test_poll_info(text: str, expected: tuple[str, Union[str, timedelta, time, int, None]]):
    assert kto.get_poll_info(text) == expected
