from datetime import timedelta, time, date

import pytest

from handlers import kto


@pytest.mark.parametrize(
    "text,expected",
    [
        ("гулять сейчас", ("гулять", ["сейчас"])),
        ("пойдёт гулять сейчас", ("пойдёт гулять", ["сейчас"])),
        ("сейчас пойдёт гулять", ("пойдёт гулять", ["сейчас"])),
        ("пойдёт сейчас гулять", ("пойдёт гулять", ["сейчас"])),
        ("борщ через 15 минут", ("борщ", [timedelta(minutes=15)])),
        ("пидор", ("пидор", [])),
        ("смотреть кино", ("смотреть кино", [])),
        ("настолки через два часа у Евгена", ("настолки у Евгена", [timedelta(hours=2)])),
        ("настолки в 18:30 у Евгена", ("настолки у Евгена", [time(18, 30)])),
        ("борщ в 19?", ("борщ", [time(19)])),
        ("борщ в 19 часов", ("борщ", [time(19)])),
        ("16:45", ("", [time(16, 45)])),
        ("через 5 минут", ("", [timedelta(minutes=5)])),
        ("спать никогда", ("спать", ["никогда"])),
        ("дрочить 19:45", ("дрочить", [time(19, 45)])),
        ("дрочить в 19:45", ("дрочить", [time(19, 45)])),
        ("10 июля в настолки в 17:30", ("в настолки", [date(2022, 7, 10), time(17, 30)])),
        ("жрать ёпта", ("жрать", ["ёпта"])),
        ("жрать ёпта?", ("жрать", ["ёпта"])),
        ("я", ("я", [])),
        ("", ("", [])),
    ],
)
def test_poll_info(text: str, expected: tuple[str, list[kto.TimeT]]):
    place, times = kto.get_poll_info(text)
    assert place == expected[0]
    assert all(t in expected[1] for t in times)
